{
  "Mango": [
    {
      "Land Preparation": "Prepare the land by ploughing, leveling and harrowing. Dig the pits of appropriate size at recommended spacing. It grows well in all types of soil provided they are deep and well drained. Red loamy soils are quite ideal. Alkaline, ill drained and soils with rocky substrata are unsuitable for its successful cultivations. Kolar, Dharwad and Belagavi red soils are best suited"
    },
    {
      "Inter Cultivation": "Plough and harrow the land in between the rows during monsoon. Sow other crops like sunhemp, cowpea or horsegram in between the rows during monsoon. This helps in improving the soil fertility and yield of mangoes. Vegetable crops can also be grown as cover crops whenever irrigation facilities are available. Prepare basins around each plant and apply the recommended dose of manures and fertilizers during June - July. Whenever there are no cover crops grown in between the rows, plough the land 2 - 3 times. Dry land crops like sunflower or groundnut can be grown as intercrops for higher profits. This will not only check the growth of weeds, but also helps in conserving soil moisture. Mango is mostly a rainfed crop but providing 1 - 2 irrigations during flowering and fruits set will give better yields."
    },
    {
      "High Density Planting": "Recent years mango crops are grown by giving lesser spacing of 15 feet x 15 feet, 18 feet x 18 feet or 22 feet x 22 feet spacing. In high density planting more number of plants can be accommodated per unit area. For high density planting suitable root stocks such as nekker, bappakai, bangalora, redsmall or ollura will be used. Amrapali verities and hybrids suitable for high density planting. Growth regulators, CCC (1000 ppm) to be used during October and November months at the pruning time. Suitable technical information should be followed for raising high density mango orchard."
    },
    {
      "Alternate Bearing In Mango": "Some mango varieties like alphanso, kesar and dhasheri yields high once in two years and medium in other years. This is the natural phenomena in mango. To over come this problem 5 ml. of paclobutrazol in 10 lt. of water to be apply to the basins at 3 ft. away from the stem before flowering (100 days). This should be done during September - October months. By this practice flowering can be encourage every year."
    }
  ],
  "Grapes": [
    {
      "Land Preparation": "Prepare the land by ploughing, leveling and harrowing. Dig the pits of appropriate size at recommended spacing. Grape can be grown on wide range of soils. Well drained loamy soil are the best. Shallow, medium black, loamy soils containing a small mixture of lime nodules and soils ranging from 1.5 to 3 feet in depth with overlying porus sub-soil suitable for its cultivation. Deep sandy or loamy soils are also good for this crodiv. Grape requires a warm dry summer and a cool winter. It does not thrive well in heavy rainfall tracts and regions of humid summer. November to January is the best time for planting."
    },
    {
      "Propagation": "Commercially grape vines are propagated by 4 to 6 bud-cuttings, taken from fully matured wood of about six months old. Choose canes with moderately short internodes for taking cuttings from their mature basal portions. Plant them in flat beds with at least two buds inserted in the soil. For better rooting in Thompson seedless soak cuttings 24 to 28 hours or 12 hours in 250 ppm IBA (250 mg. in 1 lt. of water) solution. Due to some advantages, seedless varieties of grape will be raise through eye budding. Dogredige cutting will be planted in pits (October - January). After one year growth eye buds collected from specific variety will be grafted (September - October) at 1 feet height. Allow to grow the eye budded grape vine shoot to grow along the bamboo support upto the height of the bower."
    },
    {
      "Planting": "Dig the pits of 3 feet length x 3 feet breadth x 3 feet depth during November - January and allow to weather for about 15 days. Fill, the pits with alternative layers of green leaf (Pongamia or Glyricidia) and compost or decomposed farm yard manure and finally top soil. Apply 400 g. bone meal or 400 g. super phosphate and 1 Kg. neem cake per pit (to keep away termites). Give a soaking irrigation to the pits and allow the soil to settle. Plant the rooted grape cuttings after one week."
    },
    {
      "Training": "Grape vine gives higher yields on bower system (pergola pandal) of training than on other systems of training, (Telephone kniffin, Cordon and Head). Hence, bower system is the only training system commercially practiced in the State. In the bower system, allow one main shoot to grow along the bamboo support upto the height of the bower. Remove all side shoots. Pinch the main shoot about 6 feet below the bower and allow two side shoots to grow and spread horizontally in opposite directions over the bower. These shoots form the arms (primaries) subsequently. On these in turn arms allow the 'secondaries' at an intervals of 18 inches. These in turn give rise to 'tertiaries' on which canes develop and produce the shoots carrying bunches. During the training period, tie the growing shoots regularly once  in a week with thin strip of banana fiber or jute and remove all the tendrils."
    },
    {
      "Harvest": "Grape bunches do not ripe after harvest. Hence, do not harvest immature bunches. Most of the white varieties develop a golden colour when fully ripe. When fully ripe, while black grapes usually get dark and uniform colour. For the control of post harvest berry droop in Anab-e-Shashi, spray the bunches with 100 ppm NAA (Nepthaline Acitic Acid) 8 days before harvest. The yield depends upon the variety, age of the vine and cultural practices adopted."
    }
  ],
  "Pomegranate": [
    {
      "Land Preparation": "Plough the land 2 - 3 times, harrow and bring it to a fine tilth. Dig pits of appropriate size at recommended spacing. Pomegranate is not exact in its soil requirements and can be grown on diverse types of soils. It can be grown from sandy loam to heavy soil. It can tolerate slight alkaline conditions. Deep loamy soils are however ideal for its cultivation. Pomegranate requires a cool winter, a hot and dry summer. Better quality fruits are obtained from areas with warm and dry weather during the fruiting season. It is a hardy plant and can withstand considerable amount of drought but thrives well with supplemental irrigation. June - July is ideal time for planting."
    },
    {
      "Planting": "Plough the land 2 - 3 times. Harrow and bring it to a fine tilth. Dig the pits of 2 feet length x 2 feet breadth x 2 feet depth depending on the soil type and fertility. Fill the pits with equal quantity of top soil, farm yard manure and red earth. Plant air layers or rooted cuttings in June-July and stake the plants immediately."
    },
    {
      "Propagation": "Pomegranate is propagated by air layering. For air layering select the healthy stems of pencil size. Suitable time for air layering June - September. Use of spagenomass, IBA (5000 PPM) solution induces early rooting. Propagated by stem cuttings by inducing the roots."
    },
    {
      "Inter Cropping": "For the first 5 - 6 year, grow intercrops like cowpea, cucurbits, cabbage, beans, peas, onions etc. in between the rows,. Grow green manure crops like sunhemp etc., during monsoon and incorporate the same in the soil. This will improve the texture and fertility of the soil and also improve the bearing."
    },
    {
      "Prunning": "The pomegranate has a great tendency to produce suckers from the base. These are called as water suckers. These suckers arise as multiple stems. The suckers grow vigorously without branching and reach the top. They bear very little crop. The trees with numerous water shoots present a strabge appearance with long weak shoots which bear a few fruits. These suckers may eventually dry up. Hence it is essential that the suckers are removed as soon as they arise. One of the main causes of poor bearing in the commercial orchards is the failure to remove such water suckers. The cracking of fruits is common in pomegranate mostly due to irregular water supply. This can be minimized by providing protective irrigation whenever there is long break of rains. Splitting is considerably reduced if wind breaks are planted"
    },
    {
      "Harvest": "The trees start yielding from 2nd year onwards, 20 - 25 fruits/tree can be harvested. Crop increases progressively and in the 10th year a tree may give 100 - 150 fruits per year. The average yield in well managed gardens may be as much as 200 - 250 fruits per tree (4 - 5.2 tons/ac). Economic yield can be obtained up to an age of 25 - 30 years."
    }
  ],
  "Papaya": [
    {
      "Land Preparation": "Plough the land 2 - 3 times, harrow and bring it to a fine tilth. Dig pits of appropriate size at recommended spacing. Pomegranate is not exact in its soil requirements and can be grown on diverse types of soils. It can be grown from sandy loam to heavy soil. It can tolerate slight alkaline conditions. Deep loamy soils are however ideal for its cultivation. Pomegranate requires a cool winter, a hot and dry summer. Better quality fruits are obtained from areas with warm and dry weather during the fruiting season. It is a hardy plant and can withstand considerable amount of drought but thrives well with supplemental irrigation. June - July is ideal time for planting."
    },
    {
      "Planting": "Plough the land 2 - 3 times. Harrow and bring it to a fine tilth. Dig the pits of 2 feet length x 2 feet breadth x 2 feet depth depending on the soil type and fertility. Fill the pits with equal quantity of top soil, farm yard manure and red earth. Plant air layers or rooted cuttings in June-July and stake the plants immediately."
    },
    {
      "Propagation": "Pomegranate is propagated by air layering. For air layering select the healthy stems of pencil size. Suitable time for air layering June - September. Use of spagenomass, IBA (5000 PPM) solution induces early rooting. Propagated by stem cuttings by inducing the roots."
    },
    {
      "Inter Cropping": "For the first 5 - 6 year, grow intercrops like cowpea, cucurbits, cabbage, beans, peas, onions etc. in between the rows,. Grow green manure crops like sunhemp etc., during monsoon and incorporate the same in the soil. This will improve the texture and fertility of the soil and also improve the bearing."
    },
    {
      "Prunning": "The pomegranate has a great tendency to produce suckers from the base. These are called as water suckers. These suckers arise as multiple stems. The suckers grow vigorously without branching and reach the top. They bear very little crop. The trees with numerous water shoots present a strabge appearance with long weak shoots which bear a few fruits. These suckers may eventually dry up. Hence it is essential that the suckers are removed as soon as they arise. One of the main causes of poor bearing in the commercial orchards is the failure to remove such water suckers. The cracking of fruits is common in pomegranate mostly due to irregular water supply. This can be minimized by providing protective irrigation whenever there is long break of rains. Splitting is considerably reduced if wind breaks are planted"
    },
    {
      "Harvest": "The trees start yielding from 2nd year onwards, 20 - 25 fruits/tree can be harvested. Crop increases progressively and in the 10th year a tree may give 100 - 150 fruits per year. The average yield in well managed gardens may be as much as 200 - 250 fruits per tree (4 - 5.2 tons/ac). Economic yield can be obtained up to an age of 25 - 30 years."
    }
  ],
  "Pine Apple": [
    {
      "Land Preparation": "Prepare the land by ploughing, leveling and harrowing. Dig the pits of appropriate size at recommended spacing. Grape can be grown on wide range of soils. Well drained loamy soil are the best. Shallow, medium black, loamy soils containing a small mixture of lime nodules and soils ranging from 1.5 to 3 feet in depth with overlying porus sub-soil suitable for its cultivation. Deep sandy or loamy soils are also good for this crodiv. Grape requires a warm dry summer and a cool winter. It does not thrive well in heavy rainfall tracts and regions of humid summer. November to January is the best time for planting."
    },
    {
      "Propagation": "Commercially grape vines are propagated by 4 to 6 bud-cuttings, taken from fully matured wood of about six months old. Choose canes with moderately short internodes for taking cuttings from their mature basal portions. Plant them in flat beds with at least two buds inserted in the soil. For better rooting in Thompson seedless soak cuttings 24 to 28 hours or 12 hours in 250 ppm IBA (250 mg. in 1 lt. of water) solution. Due to some advantages, seedless varieties of grape will be raise through eye budding. Dogredige cutting will be planted in pits (October - January). After one year growth eye buds collected from specific variety will be grafted (September - October) at 1 feet height. Allow to grow the eye budded grape vine shoot to grow along the bamboo support upto the height of the bower."
    },
    {
      "Planting": "Dig the pits of 3 feet length x 3 feet breadth x 3 feet depth during November - January and allow to weather for about 15 days. Fill, the pits with alternative layers of green leaf (Pongamia or Glyricidia) and compost or decomposed farm yard manure and finally top soil. Apply 400 g. bone meal or 400 g. super phosphate and 1 Kg. neem cake per pit (to keep away termites). Give a soaking irrigation to the pits and allow the soil to settle. Plant the rooted grape cuttings after one week."
    },
    {
      "Training": "Grape vine gives higher yields on bower system (pergola pandal) of training than on other systems of training, (Telephone kniffin, Cordon and Head). Hence, bower system is the only training system commercially practiced in the State. In the bower system, allow one main shoot to grow along the bamboo support upto the height of the bower. Remove all side shoots. Pinch the main shoot about 6 feet below the bower and allow two side shoots to grow and spread horizontally in opposite directions over the bower. These shoots form the arms (primaries) subsequently. On these in turn arms allow the 'secondaries' at an intervals of 18 inches. These in turn give rise to 'tertiaries' on which canes develop and produce the shoots carrying bunches. During the training period, tie the growing shoots regularly once  in a week with thin strip of banana fiber or jute and remove all the tendrils."
    },
    {
      "Harvest": "Grape bunches do not ripe after harvest. Hence, do not harvest immature bunches. Most of the white varieties develop a golden colour when fully ripe. When fully ripe, while black grapes usually get dark and uniform colour. For the control of post harvest berry droop in Anab-e-Shashi, spray the bunches with 100 ppm NAA (Nepthaline Acitic Acid) 8 days before harvest. The yield depends upon the variety, age of the vine and cultural practices adopted."
    }
  ]
}