{
    "Tomatoes": [
        {"Land Preparation": "Prepare well-drained soil, stake or cage plants for support, break soil clods for optimal growth."},
        {"Planting and Growth": "Sow seeds or transplant seedlings at recommended depth and spacing, provide consistent watering."},
        {"Fertilization": "Apply balanced fertilizers, paying attention to nutrient levels, and consider foliar feeding during critical growth stages."},
        {"Pest and Disease Management": "Monitor for pests like aphids and diseases, use recommended pesticides and fungicides as needed."},
        {"Harvesting": "Harvest when fruits are fully ripe for the best flavor and quality. Use pruning shears to cut stems, avoiding damage to the plant."}
    ],
    "Carrots": [
        {"Land Preparation": "Loosen soil to a good depth, remove stones, and incorporate organic matter for improved soil structure."},
        {"Planting and Growth": "Sow seeds in well-drained beds, thin seedlings for proper spacing, provide consistent moisture."},
        {"Fertilization": "Apply balanced fertilizers, monitor soil nutrient levels, and adjust fertilizer application accordingly."},
        {"Pest and Disease Management": "Monitor for pests such as carrot fly, practice crop rotation to manage diseases."},
        {"Harvesting": "Harvest when roots reach the desired size, typically after 70-80 days of planting. Gently loosen the soil and pull carrots carefully to avoid breakage."}
    ],
    "Spinach": [
        {"Land Preparation": "Choose well-drained soil and sow seeds directly, incorporating organic matter for moisture retention."},
        {"Planting and Growth": "Sow seeds at the recommended depth, water consistently, and harvest young leaves for the best flavor."},
        {"Fertilization": "Apply nitrogen-rich fertilizer, especially during rapid growth stages."},
        {"Pest and Disease Management": "Monitor for pests like aphids, caterpillars, and diseases, use organic or chemical controls as needed."},
        {"Harvesting": "Harvest leaves when they are large enough for consumption, typically around 4-6 weeks after planting."}
    ],
    "Bell Peppers": [
        {"Land Preparation": "Plant in fertile, well-drained soil, space plants adequately for good air circulation."},
        {"Planting and Growth": "Plant seeds or transplants at recommended spacing and depth, provide even watering."},
        {"Fertilization": "Apply balanced nutrients, especially with higher potassium content for fruit development."},
        {"Pest and Disease Management": "Monitor for pests like aphids, use integrated pest management strategies."},
        {"Harvesting": "Harvest when peppers reach the desired size and color, typically after 60-90 days of planting. Use pruning shears or a sharp knife to cut the peppers from the plant."}
    ],
    "Broccoli": [
        {"Land Preparation": "Prepare rich, well-drained soil, space plants to allow proper air circulation."},
        {"Planting and Growth": "Plant seeds or transplants at recommended spacing, keep soil consistently moist."},
        {"Fertilization": "Apply nitrogen-rich fertilizer, especially during rapid growth stages."},
        {"Pest and Disease Management": "Monitor for pests like aphids, cabbage worms, and diseases; use appropriate controls."},
        {"Harvesting": "Harvest the central head when fully developed, and before the buds start to open for optimal flavor and texture. Use a sharp knife to cut the main head just below the florets. After the main head is harvested, side shoots will develop and can be harvested later."}
    ],
    "Cucumbers": [
        {"Land Preparation": "Prepare well-drained, nutrient-rich soil. Use trellises or stakes for support."},
        {"Planting and Growth": "Plant seeds or seedlings in mounds, provide consistent watering."},
        {"Fertilization": "Apply balanced fertilizers, especially focusing on phosphorus for fruit development."},
        {"Pest and Disease Management": "Monitor for pests like cucumber beetles, use organic or chemical controls as needed."},
        {"Harvesting": "Harvest cucumbers when they are firm and green, typically 50-70 days after planting. Use pruning shears or a knife to cut the cucumbers from the plant."}
    ],
    "Lettuce": [
        {"Land Preparation": "Choose well-drained soil enriched with organic matter."},
        {"Planting and Growth": "Sow seeds directly or transplant seedlings, provide consistent moisture."},
        {"Fertilization": "Apply a balanced, nitrogen-rich fertilizer for leafy growth."},
        {"Pest and Disease Management": "Monitor for pests like aphids, use organic controls to prevent diseases."},
        {"Harvesting": "Harvest outer leaves when they reach a usable size, or harvest the entire head by cutting it at the base when mature."}
    ],
    "Zucchini": [
        {"Land Preparation": "Plant in well-drained soil with added compost. Space plants with room for their sprawling growth."},
        {"Planting and Growth": "Plant seeds or seedlings, water regularly, and consider mulching to retain moisture."},
        {"Fertilization": "Apply a balanced fertilizer, especially focusing on phosphorus and potassium for fruit development."},
        {"Pest and Disease Management": "Monitor for pests like squash bugs, use organic or chemical controls as needed."},
        {"Harvesting": "Harvest zucchini when they are 6-8 inches long for optimal tenderness. Use a knife to cut the zucchini from the plant, avoiding damage to the stem."}
    ]
}
